In [10]:
import pandas as pd
import numpy as np

In [12]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'Big boss'],
    'salary': [100, 10, 200]
})

In [13]:
df

     name  age          job  salary
0    Маша   25  Программист     100
1    Вася    8     Школьник      10
2  Эдуард   48     Big boss     200

In [14]:
name = df['name']

In [15]:
name

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [16]:
df[df['salary']>=100]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big boss     200

In [17]:
df['salary'] *= 10

In [18]:
df

     name  age          job  salary
0    Маша   25  Программист    1000
1    Вася    8     Школьник     100
2  Эдуард   48     Big boss    2000

In [19]:
df['salary'] / 2

0     500.0
1      50.0
2    1000.0
Name: salary, dtype: float64